spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_powering_on_exit() {
	m_next_delay = SMDSAT_SPI_BOOT_DELAY_MS;
}

void SmdSat::state_powering_on() {
	DEBUG_TRACE("SmdSat::%s: Starting power-on sequence", __func__);

	GPIOPins::acquire_sensors_pwr();

	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	nrf_delay_ms(10);

	// Assert wakeup pin HIGH before power-on to ensure SMD wakes from
	// STANDBY/SHUTDOWN (PB3 must be HIGH for the STM32 to stay awake)
#ifdef SAT_EXTWAKEUP
	GPIOPins::init_pin(SAT_EXTWAKEUP);
	GPIOPins::set(SAT_EXTWAKEUP);
#endif

	GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
	GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
	DEBUG_TRACE("SmdSat::%s: Power enabled | waiting for stabilization", __func__);

	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	GPIOPins::release_to_highz(SAT_RESET);
	DEBUG_TRACE("SmdSat::%s: Reset released", __func__);

	SMD_STATE_CHANGE(powering_on, idle_pending);
}

void SmdSat::state_load_kmac_enter() {}
void SmdSat::state_load_kmac_exit() {}

void SmdSat::state_load_kmac() {
	// Apply deferred RCONF from switch_modulation() while stopped.
	// This only happens on error recovery — normal modulation switches
	// are done while the SMD is still powered on (at deinit time).
	if (!m_pending_rconf.empty()) {
		DEBUG_INFO("SmdSat::%s: applying deferred RCONF for modulation %d", __func__, (int)m_modulation);
		auto wait_cmd = []() { nrf_delay_ms(SMDSAT_DELAY_CMD_MS * 2); };
		std::string rconf_bin = Binascii::unhexlify(m_pending_rconf);
		smd_uint8_array_t rconf_struct = {static_cast<uint16_t>(rconf_bin.size()),
		                                  reinterpret_cast<uint8_t *>(rconf_bin.data())};
		try {
			m_cmd.set_radio_conf(&rconf_struct);
			wait_cmd();
			m_cmd.save_radio_conf();
			wait_cmd();
			m_cmd.load_kmac_profil(1);
			wait_cmd();
			is_kmac_profil_loaded = true;
			m_credentials_written = true;
			DEBUG_INFO("SmdSat::%s: deferred RCONF applied OK", __func__);
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to apply deferred RCONF", __func__);
		}
		m_pending_rconf.clear();
	}

	// Write credentials only if changed via DTE since last write
	if (!m_credentials_written) {
		m_credentials_written = true;
		if (configuration_store && configuration_store->is_credentials_dirty()) {
			DEBUG_INFO("SmdSat::%s: credentials dirty, writing to SMD", __func__);
			if (!write_credentials_from_config()) {
				DEBUG_ERROR("SmdSat::%s: credential write failed", __func__);
				SMD_STATE_CHANGE(load_kmac, error);
				return;
			}
			configuration_store->clear_credentials_dirty();
		}
	}

	uint8_t kmac_status = 0;
	m_cmd.get_kmac_status(&kmac_status);
	if (kmac_status == MAC_OK) {
		if (!is_kmac_profil_loaded) {
			m_cmd.load_kmac_profil(1);
			m_next_delay = SMDSAT_DELAY_LOAD_KMAC_MS;
			is_kmac_profil_loaded = true;
		} else {
			m_next_delay = SMDSAT_DELAY_CMD_MS;
		}

		// Write TCXO warmup to SMD on every boot — this register is not
		// persisted in flash by the STM32 and defaults to factory value.
		try {
			m_cmd.write_tcxo_warmup(m_tcxo_warmup_time * 1000);
			DEBUG_TRACE("SmdSat::%s: TCXO warmup written: %u s", __func__, m_tcxo_warmup_time);
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: failed to write TCXO warmup", __func__);
		}

		// LPM mode: NOT IMPLEMENTED — SMD is fully powered off between TX
		// (SAT_PWR_EN=LOW in state_stopped_enter). The AT+LPM command would only
		// be useful if the SMD stays powered between TX (idle-to-idle without power cycle).
		// Kept for future use if fast back-to-back TX is needed.
		// try {
		// 	m_cmd.write_lpm(&m_lpm_mode);
		// 	DEBUG_TRACE("SmdSat::%s: LPM mode written: 0x%02X", __func__, m_lpm_mode);
		// } catch (...) {
		// 	DEBUG_WARN("SmdSat::%s: failed to write LPM mode", __func__);
		// }

		SMD_STATE_CHANGE(load_kmac, idle_pending);
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: failed to enter load kmac state",__func__);
			SMD_STATE_CHANGE(load_kmac, error);
		} else {
			m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		}
	}
}

void SmdSat::state_idle_pending_enter() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
	m_state_counter = 10;
}

void SmdSat::state_idle_pending_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
}

void SmdSat::state_idle_pending() {
	if (m_cmd.ping()) {
		if (!is_kmac_profil_loaded) {
			SMD_STATE_CHANGE(idle_pending, load_kmac);
		} else {
			SMD_STATE_CHANGE(idle_pending, idle);
		}
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: failed to enter IDLE state",__func__);
			SMD_STATE_CHANGE(idle_pending, error);
		} else {
			m_next_delay = SMDSAT_DELAY_CMD_MS;
		}
	}
}

void SmdSat::state_idle_enter() {
	m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
}

void SmdSat::state_idle_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
}

void SmdSat::state_idle() {
	if (m_packet_buffer.length()) {
		m_tx_buffer = m_packet_buffer;
		m_packet_buffer.clear();
		SMD_STATE_CHANGE(idle, transmit_pending);
	} else if (m_stopping) {
		SMD_STATE_CHANGE(idle, stopped);
	} else {
		m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		if (--m_state_counter == 0) {
			DEBUG_TRACE("SmdSat::%s: idle timeout elapsed",__func__);
			SMD_STATE_CHANGE(idle, stopped);
		}
		return;
	}

	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
}

void SmdSat::state_transmit_pending_enter() {
	m_state_counter = 3;
}

void SmdSat::state_transmit_pending_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_TX + (m_tcxo_warmup_time*1000);
}

void SmdSat::state_transmit_pending() {
	if (m_tx_buffer.size()) {
		if (!m_cmd.initiate_tx(m_tx_buffer)) {
			DEBUG_ERROR("SmdSat::%s: initiate_tx failed, aborting TX", __func__);
			m_tx_buffer.clear();
			SMD_STATE_CHANGE(transmit_pending, error);
			return;
		}
		notify(KineisEventTxStarted({}));
		SMD_STATE_CHANGE(transmit_pending, transmitting);
	} else if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed accept SEND command",__func__);
		SMD_STATE_CHANGE(transmit_pending, error);
	} else {
		m_next_delay = SMDSAT_DELAY_CMD_MS;
	}
}

void SmdSat::state_transmitting_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint32_t total_timeout_ms = (m_tcxo_warmup_time * 1000) + 5000;
	m_state_counter = (total_timeout_ms / SMDSAT_TIMING_POLL_MS) + 1;
	DEBUG_TRACE("SmdSat::%s: poll timeout=%ums | counter=%u", __func__, total_timeout_ms, m_state_counter);
}

void SmdSat::state_transmitting_exit() {
	m_is_first_tx = false;
}

