spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_transmitting() {
	if (m_cmd.is_tx_finished()) {
		if (m_tx_buffer.size()) {
			m_tx_buffer.clear();
			DEBUG_INFO("SmdSat::%s: notify KineisEventTxComplete", __func__);
			notify(KineisEventTxComplete({}));
		}
		SMD_STATE_CHANGE(transmitting, stopped);
	} else {
		if (!m_tx_buffer.size()) {
			SMD_STATE_CHANGE(transmitting, stopped);
		} else if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: TX timeout after polling",__func__);
			SMD_STATE_CHANGE(transmitting, error);
		} else {
			m_next_delay = SMDSAT_TIMING_POLL_MS;
		}
	}
}

// ============================================================================
// KineisDevice interface
// ============================================================================

void SmdSat::stop_send() {
	DEBUG_TRACE("SmdSat::%s",__func__);
	m_packet_buffer.clear();
	m_tx_buffer.clear();
}

void SmdSat::start_receive(const KineisModulation mode) {
	(void)mode;
	DEBUG_TRACE("SmdSat::%s: Not supported",__func__);
}

bool SmdSat::stop_receive() {
	DEBUG_TRACE("SmdSat::%s: Not supported",__func__);
	return false;
}

void SmdSat::set_frequency(double freq_mhz) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	m_tx_freq = freq_mhz;
}

void SmdSat::send(const KineisModulation mode, const KineisPacket& user_payload, const unsigned int payload_length)
{
	DEBUG_TRACE("SmdSat::%s: length %u mode=%d current=%d", __func__, payload_length, (int)mode, (int)m_modulation);
	SmdArgosModulation requested = kineis_to_smd_mod(mode);
	if (requested != m_modulation) {
		DEBUG_WARN("SmdSat::%s: TX mode %d != current modulation %d — call switch_modulation() first",
		           __func__, (int)requested, (int)m_modulation);
	}

	unsigned int max_payload_size = 0;
	switch(m_modulation) {
		case ARGOS_MOD_LDA2:
			max_payload_size = ARGOS_TX_LDA2_PAYLOAD_BYTE_SIZE;
			break;
		case ARGOS_MOD_LDK:
			max_payload_size = ARGOS_TX_LDK_PAYLOAD_BYTE_SIZE;
			break;
		case ARGOS_MOD_VLDA4:
			max_payload_size = ARGOS_TX_VLDA4_PAYLOAD_BYTE_SIZE;
			break;
		default:
			DEBUG_TRACE("SmdSat::%s: Unknown modulation type %d", __func__, m_modulation);
			return;
	}

	unsigned int effective_payload_length = std::min(payload_length,
	                                                 static_cast<unsigned int>(user_payload.size()));
	if (effective_payload_length > max_payload_size) {
		DEBUG_ERROR("SmdSat::%s: Payload truncated from %u to %u bytes",
		            __func__, effective_payload_length, max_payload_size);
		effective_payload_length = max_payload_size;
	}

	unsigned int padded_size = max_payload_size;
	if (m_modulation == ARGOS_MOD_LDA2) {
		padded_size = ((effective_payload_length + ARGOS_TX_LDA2_SIZE_STEP - 1) /
		                ARGOS_TX_LDA2_SIZE_STEP) * ARGOS_TX_LDA2_SIZE_STEP;
		if (padded_size < ARGOS_TX_LDA2_MIN_BYTE_SIZE)
			padded_size = ARGOS_TX_LDA2_MIN_BYTE_SIZE;
		if (padded_size > max_payload_size)
			padded_size = max_payload_size;
		DEBUG_TRACE("SmdSat::%s: LDA2 padded %u -> %u bytes", __func__, effective_payload_length, padded_size);
	}

	m_packet_buffer.assign(padded_size, 0);
	std::copy(user_payload.begin(), user_payload.begin() + effective_payload_length, m_packet_buffer.begin());

	DEBUG_TRACE("SmdSat::%s: raw data[%u]=%s", __func__,
	            effective_payload_length,
	            Binascii::hexlify(m_packet_buffer).c_str());

	DEBUG_TRACE("SmdSat::%s::Packet size %u", __func__, static_cast<unsigned int>(m_packet_buffer.size()));

	power_on();
}

void SmdSat::set_tcxo_warmup_time(unsigned int time_s) {
	m_tcxo_warmup_time = time_s;
}

void SmdSat::set_lpm_mode(uint8_t lpm_bitmap) {
	// Sanitize: STANDBY(0x08) and SHUTDOWN(0x10) require SAT_EXTWAKEUP pin
#ifndef SAT_EXTWAKEUP
	if (lpm_bitmap & 0x18) {
		DEBUG_WARN("SmdSat::%s: STANDBY/SHUTDOWN disabled (no SAT_WKUP pin), masking to 0x%02X",
		           __func__, lpm_bitmap & 0x07);
		lpm_bitmap &= 0x07;  // Keep only NONE|SLEEP|STOP
	}
#endif
	if (lpm_bitmap == 0) lpm_bitmap = 0x01;  // Fallback to NONE
	m_lpm_mode = lpm_bitmap;
}

void SmdSat::set_tx_power(unsigned int power) {
	m_tx_power = power;
}

// ============================================================================
// Auto-write credentials from config store at boot
// ============================================================================

bool SmdSat::write_credentials_from_config() {
	if (!configuration_store) return false;

	auto wait_cmd = []() { nrf_delay_ms(SMDSAT_DELAY_CMD_MS * 2); };

	unsigned int dec_id = configuration_store->read_param<unsigned int>(ParamID::ARGOS_DECID);
	unsigned int address = configuration_store->read_param<unsigned int>(ParamID::ARGOS_HEXID);
	std::string seckey = configuration_store->read_param<std::string>(ParamID::ARGOS_SECKEY);
	std::string radioconf = configuration_store->read_param<std::string>(ParamID::ARGOS_RADIOCONF);

	// Skip if credentials are not configured yet
	if (seckey.empty() || radioconf.empty()) {
		DEBUG_WARN("SmdSat::%s: credentials not configured (seckey=%u rconf=%u) | skipping",
		           __func__, (unsigned)seckey.size(), (unsigned)radioconf.size());
		return true;  // Not an error, just nothing to write
	}

	DEBUG_INFO("SmdSat::%s: writing credentials from config store (id=%u addr=0x%08X)",
	           __func__, dec_id, address);

	// Set ID
	try { m_cmd.set_id(dec_id); } catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to set ID", __func__); return false;
	}
	wait_cmd();

	// Set Address
	{
		uint8_t address_data[4] = {
			static_cast<uint8_t>((address >> 24) & 0xFF),
			static_cast<uint8_t>((address >> 16) & 0xFF),
			static_cast<uint8_t>((address >> 8) & 0xFF),
			static_cast<uint8_t>(address & 0xFF)
		};
		smd_uint8_array_t address_val = {SMDSAT_CMD_WRITE_ADDR_LEN-1, address_data};
		try { m_cmd.set_address(&address_val); } catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to set address", __func__); return false;
		}
	}
	wait_cmd();

	// Set Security Key
	{
		std::string seckey_bin = Binascii::unhexlify(seckey);
		smd_uint8_array_t seckey_struct = {static_cast<uint16_t>(seckey_bin.size()),
		                                   reinterpret_cast<uint8_t *>(seckey_bin.data())};
		try { m_cmd.set_seckey(&seckey_struct); } catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to set seckey", __func__); return false;
		}
	}
	wait_cmd();

